---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinScaleZ
source: html/68f31f91-8806-fb68-52d7-50032582077d.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodDiffusePerlinScaleZ Property

The property labeled "Anisotropic pos-z scale for diffuse albedo perlin" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodDiffusePerlinScaleZ { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".